%设计状态反馈控制器，极点P1
A=[-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B=[0;0;1;2];C=[3 0 1 0];
Qc=ctrb(A,B);
rc=rank(Qc);
P=[-1,-1,-1,-1];
K=acker(A,B,P)
%设计状态观测器，极点P2
A=[-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B=[0;0;1;2];C=[3 0 1 0];
n=4;
Qo=obsv(A,C);
ro=rank(Qo);
if (ro==n)
    disp('系统是可观测的')
    P2=[-1,-1,-1];
    A1=A';
    B1=C';
    K=acker(A1,B1,P2);
    G=K';
    AGC=A-G*C;
elseif(ro~=n)
    disp('系统是不可观测的，不能进行观测器的设计')
end


%设计基于状态观测器的状态反馈
A=[-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B=[0;0;1;2];C=[3 0 1 0];
n=size(A);
if rank(obsv(A,C))==n
    disp('系统能观，可任意配置观测器系统极点')
    P2=[-1,-1,-1,-1];
    G=(acker(A',C',P2))'
else
    disp('系统不完全能观，不可以任意配置观测器系统极点')
end
if rank(ctrb(A,B))==n
    disp('系统能控，可任意配置观测器系统极点')
    P1=[-1,-1,-1,-1];
    K=acker(A,B,P2)
else
    disp('系统不完全能控，不可以任意配置观测器系统极点')
end