%分析2-2

%题2-6
A1=[0 1;0 0];
x0=[1;1];
%求解齐次常微分方程
r=dsolve('Dx1=0*x1+1*x2','Dx2=0*x1+0*x2+1','x1(0)=1,x2(0)=1');
x1=r.x1;
x2=r.x2;
y=[1 0]*[x1;x2];

%题3-11
A2=[1 2 -1;0 1 0;0 -4 3];B2=[0;0;1];C2=[1 -1 1];
[A2_b,B2_b,C2_b,T2,K2]=ctrbf(A2,B2,C2);

A3=[-2 2 -1;0 -2 0;1 -4 0];B3=[0;0;1];C3=[1 -1 1];
[A3_b,B3_b,C3_b,T3,K3]=ctrbf(A3,B3,C3);

%题4-3 直接法
A4=[-1 1;2 -3];
P4=eye(size(A4,1));
Q4=-P4*A4-A4'*P4;

det1_1=det(Q4(1,1));
det1_2=det(Q4);
Det1=[det1_1;det1_2];
if min(Det1)>0
    '系统稳定'
else
    '系统不稳定'
end

A5=[-1 1;1 -1];
P5=eye(size(A5,1));
Q5=-P5*A5-A5'*P5;

det2_1=det(Q5(1,1));
det2_2=det(Q5);
Det2=[det1_1;det1_2];
if min(Det1)>0
    '系统稳定'
else
    '系统不稳定'
end







