clc;
clear;
A1=[0 1 0 0;0 0 -1 0;0 0 0 1;0 0 22 0];
B1=[0;1;0;-2];
C1=[1 0 0 0];
n=5;
A=[[A1,[0;0;0;0]];[-C1,0]];
B=[B1;0];
C=[C1,0];
%%%%%%%%%%%%%%%%状态反馈极点配置%%%%%%%%%%%%%%%%%%%%%
Qc=ctrb(A,B);%能控性矩阵
rc=rank(Qc);
if rc==n
     disp('系统能控，可任意进行系统极点配置')
     P1=[-10,-10,-10,   -0.7000 + 1.3664i ,-0.7000 - 1.3664i];
     K=acker(A,B,P1) 
     K1=[K(1),K(2),K(3),K(4)];
     K2=-K(5);
end
Qo=obsv(A1,C1);
if rank(Qo)==4
    disp('系统能观，可任意配置观测器系统极点')
    P2=[-10,-10,-10,-10];%观测器系统极点
    A2=A1';
    B2=C1';
    K=acker(A2,B2,P2);
    G=K'
end

