clc;
clear;
A1=[0 1 0 0;0 0 -1 0;0 0 0 1;0 0 22 0];
B1=[0;1;0;-2];
C1=[1 0 0 0];
n=5;
A=[[A1,[0;0;0;0]];[-C1,0]];
B=[B1;0];
C=[C1,0];
%%
%%%%%%%%%%%%%%%%状态反馈极点配置%%%%%%%%%%%%%%%%%%%%%
Qc=ctrb(A,B);%能控性矩阵
rc=rank(Qc);
if rc==n
     disp('系统能控，可任意进行系统极点配置')
end
%%
K1=[13.7 11.55 60.35 13.275];
K2=[-6];
s1=ss(A,B,C,0);
disp('原函数传递函数如下：')
G1=tf(s1);
G1=zpk(G1)
%%
%%%%%%%%%%%%给定超调量和调节时间%%%%%%%%%%%%
a=0.2
b=10
disp('阻尼比：')
x1=log(1/a)/(pi^2+(log(1/a))^2)^0.5
disp('固有频率：')
y1=4.4/(x1*b)
syms x y
eq1=x*y-y1^2;
eq2=x+y+2*x1*y1;
[x,y]=solve(eq1,eq2);
x=double(x)
y=double(y)


