
%设计状态反馈控制器，极点P1
A = [-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B = [0;0;1;2];
C = [1 0 1 0];
%设计状态反馈控制器，极点P1
%判断能控性
M = ctrb(A,B);
rc = rank(M);%rc = 2
if rc<3
disp('不完全能控，提取能控部分')
end
[A1,B1,C1,T1,K1] = ctrbf(A,B,C);
A2 = A1(3:4,3:4);%能控子系统
B2 = B1(3:4,1:1);
C2 = C1(1:1,3:4);

A3 = A1(1:2,1:2);%不能观子系统
B3 = B1(1:2,1:1);
C3 = C1(1:1,1:2);
vec1 = eig(A3);
if max(vec1) <0
    '不能控部分渐近稳定'
    P1 = [-5,-6];
    K2 = acker(A2,B2,P1)% K2 = 8.4971    4.0249
    K2 = [0,0,8.4971,4.0249];
    eig(A-B*K2)%检验特征值是不是都存在负实部
else
    '不能控部分非渐近稳定'
end

%特征值均小于零
%***************************************%
%%
%设计状态观测器，极点P2
%设计状态反馈控制器，极点P1
A = [-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B = [0;0;1;2];
C = [3 0 1 0];
N = obsv(A,C);
ro = rank(N);%ro=2
if ro<3
disp('不完全能观，提取能观部分')
end
%进行能观性分解
[A4,B4,C4,T4,K4] = obsvf(A,B,C);
A5 = A4(3:4,3:4);%能观子系统
B5 = B4(3:4,1:1);
C5 = C4(1:1,3:4);

A6 = A4(1:2,1:2);%不能观子系统
B6 = B4(1:2,1:1);
C6 = C4(1:1,1:2);
vec2 = eig(A6);
if max(vec2) <0
    '不能控部分渐近稳定'
    P2 = [-1,-2];
    K4 = acker(A5',C5',P2)
    K4 = [0,0,3.7947,1.2649];
    G = K4'
    eig(A-G*C)%检验特征值是不是都存在负实部
else
    '不能控部分非渐近稳定'
end
%特征值均小于零
%***************************************%
%% 基于状态观测器的状态反馈
%设计状态反馈控制器，极点P1
A = [-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B = [0;0;1;2];
C = [3 0 1 0];
%设计状态反馈控制器，极点P1
%判断能控性
M = ctrb(A,B);
rc = rank(M);%rc = 2
if rc<3
disp('不完全能控，提取能控部分')
end
[A1,B1,C1,T1,K1] = ctrbf(A,B,C);
A2 = A1(3:4,3:4);%能控子系统
B2 = B1(3:4,1:1);
C2 = C1(1:1,3:4);

A3 = A1(1:2,1:2);%不能观子系统
B3 = B1(1:2,1:1);
C3 = C1(1:1,1:2);
vec1 = eig(A3);
if max(vec1) <0
    '不能控部分渐近稳定'
    P1 = [-5,-6];
    K2 = acker(A2,B2,P1)% K2 = 2.2361 0.4472
    K2 = [0,0,2.2361,0.4472];
    eig(A-B*K2)%检验特征值是不是都存在负实部
else
    '不能控部分非渐近稳定'
end

%特征值均小于零
%***************************************%

%设计状态观测器，极点P2
%设计状态反馈控制器，极点P1
A = [-1 0 0 0;2 -3 0 0;0 0 2 0;4 -1 2 -4];
B = [0;0;1;2];
C = [3 0 1 0];
N = obsv(A,C);
ro = rank(N);%ro=2
if ro<3
disp('不完全能观，提取能观部分')
end
%进行能观性分解
[A4,B4,C4,T4,K4] = obsvf(A,B,C);
A5 = A4(3:4,3:4);%能观子系统
B5 = B4(3:4,1:1);
C5 = C4(1:1,3:4);

A6 = A4(1:2,1:2);%不能观子系统
B6 = B4(1:2,1:1);
C6 = C4(1:1,1:2);
vec2 = eig(A6);
if max(vec2) <0
    '不能控部分渐近稳定'
    P2 = [-1,-2];
    K4 = acker(A5',C5',P2)
    K4 = [0,0,3.7947,1.2649];
    G = K4'
    eig(A-G*C)%检验特征值是不是都存在负实部
else
    '不能控部分非渐近稳定'
end
%特征值均小于零
%***************************************%



